app/controllers/api/todos_controller.rb

    def create
        @todo = Todo.new(todo_params)

        if @todo.save
---
INSERT INTO "todos" ("title", "body", "done") VALUES ($1, $2, $3) RETURNING "id"  [["title", "title"], ["body", "body"], ["done", true]]